Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.GetUserProperty Method
Overload List
Name | Description
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
Top
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace